       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG7.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           DISPLAY "Está aki vai ser uma frase bem grande para poder "
      -    ". AI. Proxima linha, string grande para caber em 1 linha".
      *    Esse tracinho ali no canto é 1 comando para que o programa entenda
      *    Para interpretar como se fosse 1 linha só
