       IDENTIFICATION DIVISION. *> Vai contar infos basicas sobre o programa *>
       PROGRAM-ID. prog1. *> EXENCIAL, NÃO PODE FALTAR*>
       ENVIRONMENT DIVISION. *> Configuração de Maquinas e Mainframes*>
       DATA DIVISION. *> É onde está as Variavies do Programa*>

       PROCEDURE DIVISION. *> AKI vai conter a Logica do Programa, as instruções a serem executadas *>

       PROGRAM-BEGIN. *>Intrução para Iniciar o Programa *>
           DISPLAY "Salve Mundo". *> Exibir a Mensagem*>

      * Comentario, pra comentar coloca * na coluna 7

       PROGRAM-DONE. *>Intrução para Finalizar o Programa *>
           STOP RUN. *> Vai dar STOP no Programa *>
