       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG34.
      *    Programa para Criar Arquivo Indexado

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *    LEMBRETE: NAÕ EXISTE COMANDO "OPTIONAL" EM ARQUIVOS INDEXADOS
           SELECT ARQUIVO-FUNCIONARIO ASSIGN TO "funcionarios.dat"
           ORGANISATION IS INDEXED
           RECORD KEY IS FUNCIONARIO-CODIGO
           ACCESS MODE IS DYNAMIC.

       DATA DIVISION.
       FILE SECTION.
       FD  ARQUIVO-FUNCIONARIO.
       01  FUNCIONARIO-REGISTRO.
           05 FUNCIONARIO-CODIGO PIC 9(4).
           05 FUNCIONARIO-NOME PIC X(20).
           05 FUNCIONARIO-ENDERECO PIC X(50).
           05 FUNCIONARIO-TELEFONE PIC X(30).

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
      *    aKI É SÓ PRA CRIAR E FECHAR
           OPEN OUTPUT ARQUIVO-FUNCIONARIO.
           CLOSE ARQUIVO-FUNCIONARIO.

       PROGRAM-DONE.
           STOP RUN.
