           SELECT ARQUIVO-FUNCIONARIO ASSIGN TO "funcionarios.dat"
           ORGANISATION IS INDEXED RECORD KEY IS FUNCIONARIO-CODIGO
           ACCESS MODE IS DYNAMIC.
