       IDENTIFICATION DIVISION.
      *    Demonstrando Constantes
       PROGRAM-ID. PROG2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "Salve Garai".
           DISPLAY 59.
           DISPLAY 12.627.

       PROGRAM-DONE.
           STOP RUN.
