       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG35.
      *    Programa para Inserir Dados em Arquivos Indexados

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *    LEMBRETE: NAÕ EXISTE COMANDO "OPTIONAL" EM ARQUIVOS INDEXADOS
           SELECT ARQUIVO-FUNCIONARIO ASSIGN TO "funcionarios.dat"
           ORGANISATION IS INDEXED
           RECORD KEY IS FUNCIONARIO-CODIGO
           ACCESS MODE IS DYNAMIC.

       DATA DIVISION.
       FILE SECTION.
       FD  ARQUIVO-FUNCIONARIO.
       01  FUNCIONARIO-REGISTRO.
           05 FUNCIONARIO-CODIGO PIC 9(4).
           05 FUNCIONARIO-NOME PIC X(20).
           05 FUNCIONARIO-ENDERECO PIC X(50).
           05 FUNCIONARIO-TELEFONE PIC X(30).
           05 FUNCIONARIO-EMAIL PIC X(30).

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
      *    aKI É SÓ PRA CRIAR E FECHAR
           OPEN I-O ARQUIVO-FUNCIONARIO.

           PERFORM LER-ESCREVER-REGISTRO.

           CLOSE ARQUIVO-FUNCIONARIO.

       PROGRAM-DONE.
           STOP RUN.

       LER-ESCREVER-REGISTRO.
           MOVE SPACES TO FUNCIONARIO-REGISTRO.
           MOVE ZEROS TO FUNCIONARIO-CODIGO.
           DISPLAY "INFORME O CODIGO DO FUNCIONARIO (1-9999)".
           ACCEPT FUNCIONARIO-CODIGO.
           DISPLAY "INFORME O NOME DO FUNCIONARIO:"
           ACCEPT FUNCIONARIO-NOME.
           DISPLAY "INFORME O ENDERECO DO FUNCIONARIO:"
           ACCEPT FUNCIONARIO-ENDERECO.
           DISPLAY "INFORME O TELEFONE DO FUNCIONARIO:"
           ACCEPT FUNCIONARIO-TELEFONE.
           DISPLAY "INFORME O EMAIL DO FUNCIONARIO:"
           ACCEPT FUNCIONARIO-EMAIL.

           WRITE FUNCIONARIO-REGISTRO.
