       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "Salve Mundo".

       PROGRAM-DONE.
           STOP RUN.
