       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG26.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
      *    Numeros Decimais

       WORKING-STORAGE SECTION.
      *        essa porra não pode separar, N(N)"COMANDO V"N(N)
       01  VALOR1 PIC 9(5)V9(2) VALUE 76543.98.
       01  VALOR2 PIC 9(2)V9(2) VALUE 92.36.
       01  RESULTADO1 PIC 9(5)V9(2).
       01  VALOR3 PIC S999V99 VALUE -587.21.
      *    TEM Q COLOCAR A PORRA DUM "S" DO LADO DO 9 PRA ELE INTERPRETAR CASO DE VALOR NEGATIVO
       01  RESULTADO2 PIC S9(5)V9(2).

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           COMPUTE RESULTADO1 = VALOR1 + VALOR2.
           DISPLAY VALOR1 " + " VALOR2 " = " RESULTADO1.

           DISPLAY "==========="

           COMPUTE RESULTADO2 = VALOR3 + VALOR2.
           DISPLAY VALOR2 " + (" VALOR3 ") = " RESULTADO2.

       PROGRAM-DONE.
           STOP RUN.
